In [1]:
import pandas
pandas.__version__

'1.0.1'

In [4]:
import numpy as np
import pandas as pd

In [6]:
counts=pd.Series([632,1638,569,115])
counts

0     632
1    1638
2     569
3     115
dtype: int64

In [7]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [9]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
bacteria=pd.Series([632,1638,569,115],
                   index=['firmicutes','proteobacteria','actinobacteria','bacteroidetes'])
bacteria

firmicutes         632
proteobacteria    1638
actinobacteria     569
bacteroidetes      115
dtype: int64

In [13]:
bacteria['actinobacteria']

569

In [17]:
bacteria[0]

632

In [14]:
bacteria.name='counts'
bacteria.index.name='phylum'
bacteria

phylum
firmicutes         632
proteobacteria    1638
actinobacteria     569
bacteroidetes      115
Name: counts, dtype: int64

In [15]:
np.log(bacteria)

phylum
firmicutes        6.448889
proteobacteria    7.401231
actinobacteria    6.343880
bacteroidetes     4.744932
Name: counts, dtype: float64

In [18]:
bacteria[bacteria>1000]

phylum
proteobacteria    1638
Name: counts, dtype: int64

In [19]:
bacteria_dict={'firmicute':632,'proteobacteria':1500,'actinobacteria':569,'bacteroidetes':115}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'firmicute': 632, 'proteobacteria': 1500, 'actinobacteria': 569, 'bacteroidetes': 115}

firmicute          632
proteobacteria    1500
actinobacteria     569
bacteroidetes      115
dtype: int64

In [20]:
data={"province":["fl","fl","nh","nh","zh"],
      "year":[2013,2014,2013,2014,2014],
      "literacy":[0.2,0.1,0.5,0.3,0.5]}
print(data)
data=pd.DataFrame(data)
data

{'province': ['fl', 'fl', 'nh', 'nh', 'zh'], 'year': [2013, 2014, 2013, 2014, 2014], 'literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  province  year  literacy
0       fl  2013       0.2
1       fl  2014       0.1
2       nh  2013       0.5
3       nh  2014       0.3
4       zh  2014       0.5

In [22]:
df=pd.DataFrame(data,columns=["year","province","literacy"])
df

   year province  literacy
0  2013       fl       0.2
1  2014       fl       0.1
2  2013       nh       0.5
3  2014       nh       0.3
4  2014       zh       0.5

In [24]:
df['nonsense']=df.year/df.literacy
df

   year province  literacy      nonsense
0  2013       fl       0.2  10065.000000
1  2014       fl       0.1  20140.000000
2  2013       nh       0.5   4026.000000
3  2014       nh       0.3   6713.333333
4  2014       zh       0.5   4028.000000

In [25]:
df['series_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   year province  literacy      nonsense  series_aligned
0  2013       fl       0.2  10065.000000               0
1  2014       fl       0.1  20140.000000               1
2  2013       nh       0.5   4026.000000               2
3  2014       nh       0.3   6713.333333               3
4  2014       zh       0.5   4028.000000               4

In [26]:
df.to_dict()

{'year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'province': {0: 'fl', 1: 'fl', 2: 'nh', 3: 'nh', 4: 'zh'},
 'literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'series_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [27]:
pd.DataFrame(df.to_dict())

   year province  literacy      nonsense  series_aligned
0  2013       fl       0.2  10065.000000               0
1  2014       fl       0.1  20140.000000               1
2  2013       nh       0.5   4026.000000               2
3  2014       nh       0.3   6713.333333               3
4  2014       zh       0.5   4028.000000               4

In [28]:
df.to_dict()

{'year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'province': {0: 'fl', 1: 'fl', 2: 'nh', 3: 'nh', 4: 'zh'},
 'literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'series_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [29]:
data=[{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [30]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [31]:
pd.DataFrame(np.random.randint(2,12),
            columns=['foo','bar'],
            index=['a','b','c'])

   foo  bar
a   11   11
b   11   11
c   11   11